app/controllers/api/v1/countries_controller.rb

      def index
        alpha2 = params[:alpha2] || false
        alpha3 = params[:alpha3] || false

        countries = Country.where(active: true)
        countries = countries.where(alpha2: alpha2) if alpha2
        countries = countries.where(alpha3: alpha3) if alpha3
        @countries = countries.all
---
SELECT "countries".* FROM "countries" WHERE "countries"."active" = ? AND (alpha3 LIKE '%ata%' )  [["active", 1]]
SELECT "countries".* FROM "countries" WHERE "countries"."active" = ? AND "countries"."alpha2" = ? ORDER BY "countries"."id" ASC LIMIT ?  [["active", 1], ["alpha2", "za"], ["LIMIT", 1]]
SELECT "countries".* FROM "countries" WHERE "countries"."active" = ? AND "countries"."alpha2" = ? AND "countries"."alpha3" = ?  [["active", 1], ["alpha2", "at"], ["alpha3", "ata"]]
SELECT "countries".* FROM "countries"

      def delete
        begin
          alpha2 = params[:alpha2] || false
          raise 'No Alpha2 provided' unless alpha2

          countries = Country.where(active: true)
          country = countries.where(alpha2: alpha2).first if alpha2
          raise "Country with alpha2 `#{alpha2}` not found." unless country

          country.update(active: false)
---
SELECT "countries".* FROM "countries" WHERE "countries"."active" = ?  [["active", 1]]
SELECT "countries".* FROM "countries" WHERE "countries"."active" = ? AND "countries"."alpha2" = ? ORDER BY "countries"."id" ASC LIMIT ?  [["active", 1], ["alpha2", "at"], ["LIMIT", 1]]
UPDATE "countries" SET "active" = ?, "updated_at" = ? WHERE "countries"."id" = ?  [["active", 0], ["updated_at", "2021-05-16 08:07:19.036560"], ["id", 40]]

      def update
        begin
          alpha2 = params[:alpha2] || false
          raise 'No Alpha2 provided' unless alpha2

          countries = Country.where(active: false)
          country = countries.where(alpha2: alpha2).first if alpha2
          raise "Deleted Country with alpha2 `#{alpha2}` not found." unless alpha2 && country

          country.update(active: true)
---
SELECT "countries".* FROM "countries" WHERE "countries"."active" = ? AND "countries"."alpha2" = ? ORDER BY "countries"."id" ASC LIMIT ?  [["active", 1], ["alpha2", "at"], ["LIMIT", 1]]
UPDATE "countries" SET "active" = ?, "updated_at" = ? WHERE "countries"."id" = ?  [["active", 1], ["updated_at", "2021-05-16 08:11:52.791916"], ["id", 40]]